tap "homebrew/bundle"
tap "homebrew/core"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# BLAKE2 b2sum reference binary
brew "b2sum"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Extremely Fast Compression algorithm
brew "lz4"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Cross-platform make
brew "cmake"
# Generate a Clang compilation database for Make-based build systems
brew "compiledb"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Modern, maintained replacement for ls
brew "eza"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# OpenType text shaping engine
brew "harfbuzz"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Library for interacting with JSON
brew "jsoncpp"
# Development kit for the Java programming language
brew "openjdk"
# Statically typed programming language for the JVM
brew "kotlin"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Generic library support script
brew "libtool"
# Java-based project management
brew "maven"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Platform built on V8 to build network applications
brew "node"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Paste PNG into files
brew "pngpaste"
# Theme for zsh
brew "powerlevel10k"
# Cross-platform application and UI framework
brew "qt"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
